## Fundamentals in Statistics and Data Cleaning using Pandas

#### Goal: To conduct data manipulation with pandas then undertake basic statistical analysis.
#### Dataset: Car Financing

In [450]:
# Import and load the data

import numpy as np
import pandas as pd
from scipy import stats

df = pd.read_csv('car_financing.csv', index_col=0)

In [452]:
# Check the dataset.
df.head(2)
df.tail(2)

,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
Month,,,,,,,,
59,1586.00,796.01,3.83,792.18,793.82,60,0.029,VW Golf R
60,793.82,796.01,1.91,794.10,-0.28,60,0.029,VW Golf R

In [453]:
# Check the data types
df.dtypes

Starting Balance    float64
Repayment           float64
Interest Paid       float64
Principal Paid      float64
New Balance         float64
term                  int64
interest_rate       float64
car_type             object
dtype: object

In [455]:
### The term has int64 > than float64 in storage.

In [457]:
# Check the shape/array of the data
df.shape

(408, 8)

In [459]:
# Check the info to see the non-null values.
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 408 entries, 1 to 60
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Starting Balance  408 non-null    float64
 1   Repayment         408 non-null    float64
 2   Interest Paid     408 non-null    float64
 3   Principal Paid    408 non-null    float64
 4   New Balance       408 non-null    float64
 5   term              408 non-null    int64
 6   interest_rate     408 non-null    float64
 7   car_type          408 non-null    object
dtypes: float64(6), int64(1), object(1)
memory usage: 28.7+ KB

In [461]:
# how many times do car models appear?
df['car_type'].value_counts()

car_type
VW Golf R         144
Toyota Sienna     120
Toyota Carolla    111
Toyota Corolla     33
Name: count, dtype: int64

In [463]:
# Fliter for a specific car model.
##car_filter = df['car_type']== 'Toyota Corolla'

In [465]:
##car_filter.head(2)

In [467]:
# Filter df for 'Toyota Corolla'.
##df = df.loc[car_filter,:]

In [469]:
###df['car_type'].value_counts()

In [471]:
# Filter the interest rates.
df['interest_rate'].value_counts()

interest_rate
0.0290    144
0.0390    144
0.0359     60
0.0702     60
Name: count, dtype: int64

In [473]:
##interest_filter = df['interest_rate']==0.0359
##print(interest_filter.head(2))

In [475]:
##df = df.loc[interest_filter, :]

In [477]:
##df['interest_rate'].value_counts(dropna = True)

In [479]:
# Rename certain columns in the dataset.
df = df.rename(columns= ({'Starting Balance':'starting_balance', 
                        'Interest Paid':'interest_paid',
                        'Principal Paid': 'principal_paid',
                        'New Balance': 'new_balance',
                         'Repayment': 'repayment'}))
print(df.head(2))

       starting_balance  repayment  interest_paid  principal_paid  \
Month
1              34689.96     687.23         202.93          484.30
2              34205.66     687.23         200.10          487.13

       new_balance  term  interest_rate       car_type
Month
1         34205.66    60         0.0702  Toyota Sienna
2         33718.53    60         0.0702  Toyota Sienna

In [481]:
#Filter for any missing/null values.
df['interest_paid'].isna().head()

Month
1    False
2    False
3    False
4    False
5    False
Name: interest_paid, dtype: bool

In [483]:
interest_missing = df['interest_paid'].isna()

In [485]:
df.loc[interest_missing,:]

Empty DataFrame
Columns: [starting_balance, repayment, interest_paid, principal_paid, new_balance, term, interest_rate, car_type]
Index: []

#### Statistical Summary

In [489]:
# Exploratory data analysis.

df.describe()

,starting_balance,repayment,interest_paid,principal_paid,new_balance,term,interest_rate
count,408.000000,408.000000,408.000000,408.000000,408.000000,408.000000,408.000000
mean,17562.870343,712.134118,56.715123,655.418995,16907.451348,52.941176,0.039603
std,11224.423084,247.447947,40.775353,245.361625,11168.974693,9.268926,0.013414
min,395.410000,396.820000,1.280000,326.620000,-0.490000,36.000000,0.029000
25%,8557.900000,486.740000,26.257500,476.972500,7832.080000,48.000000,0.029000
50%,16262.230000,661.995000,50.640000,598.135000,15539.305000,60.000000,0.037450
75%,25285.055000,796.010000,76.357500,760.790000,24535.925000,60.000000,0.039000
max,44409.600000,1289.530000,202.930000,1286.430000,43720.910000,60.000000,0.070200

In [490]:
# What is the lowest interest rate?
interest_first= df.groupby('interest_paid')
interest_first.first().head()

,starting_balance,repayment,principal_paid,new_balance,term,interest_rate,car_type
interest_paid,,,,,,,
1.28,395.41,396.82,395.54,-0.13,60,0.0390,Toyota Carolla
1.57,485.02,486.74,485.17,-0.15,48,0.0390,Toyota Carolla
1.88,630.23,632.47,630.59,-0.36,60,0.0359,Toyota Sienna
1.91,793.82,796.01,794.10,-0.28,60,0.0290,VW Golf R
2.06,634.43,636.76,634.70,-0.27,36,0.0390,Toyota Corolla